---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.SketchFailures.StairClosedBoundaries
source: html/47203f99-b952-1310-5af3-074fa7016205.htm
---
# Autodesk.Revit.DB.BuiltInFailures.SketchFailures.StairClosedBoundaries Property

Stairs Boundaries (chains of one or more Boundary Lines) should not form closed loops.

## Syntax (C#)
```csharp
public static FailureDefinitionId StairClosedBoundaries { get; }
```